{
  "basketball": [
    {
      "messageType": "header",
      "message": "Rules for offence",
      "component": "h2"
    },
    {
      "messageType": "list",
      "message": [
        "The basketball team on offense is the team with the basketball. When a player has basketball, there are specific rules they must follow:",
        "The player must bounce or dribble the ball with one hand while moving both feet. If, at any time, both hands touch the ball or the player stops dribbling, the player must only move one foot.",
        "The basketball player can only take one turn at dribbling. In other words, once a player has stopped dribbling, they cannot start another dribble. A player who starts dribbling again is called for a double-dribbling violation and loses the basketball to the other team. A player can only begin to dribble after another player from either team touches or gains control of the basketball. This is usually after a shot or pass.",
        "The ball must stay in bounds. If the offensive team loses the ball out of bounds, the other team gets control of the basketball.",
        "The player's hand must be on top of the ball while dribbling. If they touch the bottom of the basketball while dribbling and continue to dribble this is called carrying the ball, and the player will lose the ball to the other team.",
        "Once the offensive team crosses half-court, they may not go back into the backcourt. This is called a backcourt violation. If the defensive team knocks the ball into the backcourt, the offensive team can legally recover the ball.",
        "We cannot carry the ball to ourselves for more than 24 seconds."
      ]
    }
  ],

  "football": [
    { "messageType": "header", "message": "General rules" },
    {
      "messageType": "list",
      "message": [
        "Every football game begins with a toss. The two team captains meet in the middle of the pitch with the match referee. The captain of the winning team (toss winner chooses which goalpost to pursue in the first half.",
        "The venue will be DTS ground with standard dimensions.",
        "Each team consists of 11 players (1 goalkeeper and 10 outfield players), Squad strength- 15(11 playing and 4 substitute) Substitutions can be made at any time of the match with each team being able to make a maximum of 4 substitutions per side.In the event of all substitutes being made and a player having to leave the field for injury the team will be forced to play without a replacement for that player.",
        "Duration of league match – 50 minutes, 2 halves each of 25 minutes.",
        "Duration of final match – 60 minutes, 2 halves each of 30 minutes.",
        "Duration of break after 1st half- 5 minutes. If the game needs to head to extra time as a result of both teams being level in a match then 20 minutes will be added in the form of two 10 minute halves after the allotted 50 minutes.",
        "OFFSIDE RULE- Offside can be called when an attacking player is in front of the last defender when the pass is played through to them.",
        "Coach cum player rule is applicable in the whole tournament."
      ]
    }
  ],
  "cricket": [
    { "messageType": "header", "message": "GENERAL RULES" },
    {
      "messageType": "list",
      "message": [
        "Includes the new rule of a new batsman taking the strike after a batsman has been caught.",
        "Also includes the new rule for a free hit in any kind of no-ball.",
        "All matches will be played with a white leather ball.",
        "The umpire’s decision will be final.",
        "There will be no DRS.",
        "The league matches will be 15 overs in which there will be a 4-over powerplay (In the powerplay, a maximum of two players can be outside the 30-yard circle.), and one bowler can bowl a maximum of 3 overs.",
        "In the final match, 20 overs will be played in which there will be a 6- over powerplay (In the powerplay, a maximum of two players can be outside the 30 yards circle.), and one bowler will be allowed to bowl a maximum of 4 overs.",
        "A maximum of 5 players can stay outside the 30-yard circle during non-powerplay overs.",
        "Maximum of 5 players on the leg side of the batter.",
        "The time limit for each inning is 65 minutes for league matches and 85 minutes for the final game. (There are 10 minutes of drinks break in between the innings)."
      ]
    }
  ],
  "volleyball": [
    { "messageType": "header", "message": "General rules" },
    {
      "messageType": "list",
      "message": [
        "The league matches will be evaluated based on the best of 3 sets of 25 points each.",
        "The semi-finals and finals will be evaluated based on the best of 5 sets each of 25 points.",
        "Matches are to be played within the one-hour time limit. If the third match is not started by 50 minutes past game time, the third game will be played to 15 points. The match will conclude 60 minutes after the scheduled start time, regardless of the score.",
        "the interval between 2 sets should not be more than 2 minutes in which the teams should switch sides.",
        "2 timeouts to each team per set with a duration of 30.",
        "Teams must bring their own volleyballs for practice. No balls will be provided by the institute for practice.",
        "No extra warmup time will be provided."
      ]
    }
  ],
  "chess": [
    { "messageType": "header", "message": "General Rules" },
    {
      "messageType": "list",
      "message": [
        "Chess competition will be played per the “FIDE Laws of Chess”",
        "Tournament rules will be used with the Laws of Chess.",
        "It is a team event, and the team needs 5 players.",
        "A minimum of 4 players are a must for a team.",
        "A maximum of 5 players are allowed in a team, of which 1 player will be a substitute.",
        "In a particular round, 4 players of a team can play.",
        "There will be no separate tournament for girls; instead, only a single tournament open to all.",
        "All team players must belong to the same institute.",
        "The role of a team captain is basically an administrative one during play.",
        "Time Control: Each player will get 60 minutes plus 30 30-second increments for every move from move number one.",
        "IMPORTANT NOTE:Rules & schedules are subject to change in the spirit of the game & the festival. The final decision in all matters rests with the Vriddhi team."
      ]
    }
  ],
  "tabletennis": [
    { "messageType": "header", "message": "RULES FOR RACKET" },
    {
      "messageType": "list",
      "message": [
        "The racket may be of any size, shape, or weight but the blade shall be flat and rigid.",
        "A side of the blade used for striking the ball shall be covered with either ordinary pimpled rubber, with pimples outwards having a total thickness including adhesive of not more than 2.0mm, or sandwich rubber, with pimples inwards or outwards, having a total thickness including adhesive of not more than 4.0mm.",
        "The covering material shall extend up to but not beyond the limits of the blade. The blade, any layer within the blade and any layer of covering material or adhesive on a side used for striking the ball shall be continuous and of even thickness.",
        "Before the start of a match and whenever he or she changes his or her racket during a match a player shall show his or her opponent and the umpire the racket he or she is about to use and shall allow them to examine it."
      ]
    }
  ],
  "khokho": [
    { "messageType": "header", "message": "GENERAL RULES" },
    {
      "messageType": "list",
      "message": [
        "A team consists 12 player and 9 player will take the field",
        "Each game consists 2 innings and each innings consists of 2 turns(chasing and defending turns) each of 9 minute duration for both men and women.",
        "There will be a 3 minutes break between each turn and a 6 minutes break after each innings.",
        "Referee shall call both the captains for the spin of the coin.He shall instruct one of them to call the choice of the side of the coin. The captain who won the toss will choose running or defending which is for both innings.",
        "The chasing team scores one point for each runner who is out. ",
        "After the commencement of a turn, no Chaser shall leave the Chaser Block without getting a KHO or change the face.",
        "If he does so, it is a Foul and repetition of the same will amount to misbehavior.",
        "At the commencement of a turn, the first batch of three Defenders shall be inside the Field. Subsequently next 3 Runners shall enter the Court through their Entry Zone only. When third Defender of a batch is declared out.",
        "If a KHO is given, it shall be given from behind a Chaser by touching the Chaser by hand between an imaginary shoulder line and waist line and uttering the word 'KHO' with a sufficiently loud tone so that the Defender and officials can hear. Chaser shall not get up without getting a KHO."
      ]
    }
  ],
  "badminton": [
    { "messageType": "header", "message": "General Rules" },
    {
      "messageType": "list",
      "message": [
        "Each team should have 6 (5+1S) members.",
        "Each player can play a maximum of one single and one double.",
        "A match consists of the best of 3 rounds, each consisting of 15 points.",
        "The side winning a round will serve first in the next round.",
        "A player should never touch the net with his racquet or body while playing.",
        "A badminton serve must be hit underarm and below the server's waist height with the racquet shaft pointing downwards.",
        "If the server wins a rally, the server scores a point and then serves again from the alternate service court."
      ]
    }
  ],
  "kabaddi": [
    { "messageType": "header", "message": "General Rules" },
    {
      "messageType": "list",
      "message": [
        "The match starts with a coin toss between the two teams and the winner can decide whether to raid or defend first.",
        "Each team is allowed two time-outs in a half.",
        "Each team in a kabaddi match has 7 players. The teams can also have 5 substitute players on the bench.",
        "The Weight Limit is 85 kg (mandatory) for boys, i.e., any boy recorded as weighing more than 85 kg shall not be allowed to participate in this event.",
        "Each team shall consist of a minimum of 12 players and 7 Players shall take to the mat at a time and the remaining players are substitutes.",
        "The duration of the match shall be two halves of 20 minutes.",
        "Each team shall score one point for every opponent out or put out. The side, which scores a LONA, shall score two extra points. The out and revival rule will be applicable."
      ]
    }
  ]

}
